var list = {
    КлетчаткаПищевая : {
        'name'   :'Клетчатка пищевая',
        'gindex' :'30',
        'calo'   :'205',
        'carb'   :'14',
        'prot'   :'17',
        'fat'    :'3.9',
        'vita'   :'Клетчатка',
        'tags' : 'Зерновые продукты и изделия из муки' 

    },

    МукаСоеваяОбезжиренная : {
        'name'   :'Мука соевая обезжир.',
        'gindex' :'15',
        'calo'   :'291',
        'carb'   :'21.7',
        'prot'   :'48.9',
        'fat'    :'1',
        'vita'   :'PP,B1,B2,E',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    Отруби : {
        'name'   :'Отруби',
        'gindex' :'51',
        'calo'   :'191',
        'carb'   :'23.5',
        'prot'   :'15.1',
        'fat'    :'3.8',
        'vita'   :'Клетчатка, B1, B2, B3, B6, B9, A, E',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ОвсяныеХлопьяСырые : {
        'name'   :'Овсяные хлопья сырые',
        'gindex' :'40',
        'calo'   :'305',
        'carb'   :'50',
        'prot'   :'11',
        'fat'    :'6.2',
        'vita'   :'В1, В2, В5, В6, В9, Е, Н и РР',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ПерловаяКашаВода : {
        'name'   :'Перловая каша на воде',
        'gindex' :'22',
        'calo'   :'109',
        'carb'   :'22.2',
        'prot'   :'3.1',
        'fat'    :'0.4',
        'vita'   :'В, А, D, Е, Н и РР',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ОвсянаяКашаВода : {
        'name'   :'Овсяная каша на воде',
        'gindex' :'49',
        'calo'   :'49',
        'carb'   :'9',
        'prot'   :'3.1',
        'fat'    :'1.1',
        'vita'   :'B1, B6, E, H, PP',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ЯчменнаяКашаМолоко : {
        'name'   :'Ячменная каша на молоке',
        'gindex' :'50',
        'calo'   :'111',
        'carb'   :'19.8',
        'prot'   :'3.6',
        'fat'    :'2',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    РисНешлифОтварной : {
        'name'   :'Рис нешлифованный отварной',
        'gindex' :'65',
        'calo'   :'125',
        'carb'   :'36',
        'prot'   :'2.7',
        'fat'    :'0.7',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    МакароныГрубПомол : {
        'name'   :'Макароны, мука грубого помола',
        'gindex' :'38',
        'calo'   :'113',
        'carb'   :'23.2',
        'prot'   :'4.7',
        'fat'    :'0.9',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ХлебЗерновой : {
        'name'   :'Хлеб зерновой',
        'gindex' :'40',
        'calo'   :'222',
        'carb'   :'43.9',
        'prot'   :'8.6',
        'fat'    :'1.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ХлебЦельнозерновой : {
        'name'   :'Хлебцы цельнозерновые',
        'gindex' :'45',
        'calo'   :'291',
        'carb'   :'56.5',
        'prot'   :'11.3',
        'fat'    :'2.1',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ХлебБородинский : {
        'name'   :'Хлеб "Бородинский"',
        'gindex' :'45',
        'calo'   :'202',
        'carb'   :'40.7',
        'prot'   :'6.8',
        'fat'    :'1.3',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ОвсянаяКашаМолока : {
        'name'   :'Овсяная каша на молоке',
        'gindex' :'60',
        'calo'   :'116',
        'carb'   :'13.7',
        'prot'   :'4.8',
        'fat'    :'5.1',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ГречневаяКашаВода : {
        'name'   :'Гречневая каша на воде',
        'gindex' :'50',
        'calo'   :'153',
        'carb'   :'29',
        'prot'   :'5.9',
        'fat'    :'1.6',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    МакароныТверд : {
        'name'   :'Макароны из тв. сортов пшеницы',
        'gindex' :'50',
        'calo'   :'140',
        'carb'   :'27',
        'prot'   :'5.5',
        'fat'    :'1.1',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    МаннаяКашаМолоко : {
        'name'   :'Манная каша на молоке',
        'gindex' :'65',
        'calo'   :'122',
        'carb'   :'15.3',
        'prot'   :'3',
        'fat'    :'5.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    РисоваяКашаМолоко : {
        'name'   :'Рисовая каша на молоке',
        'gindex' :'70',
        'calo'   :'101',
        'carb'   :'18',
        'prot'   :'2.9',
        'fat'    :'1.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ХлебРжаной : {
        'name'   :'Хлеб ржано-пшеничный',
        'gindex' :'65',
        'calo'   :'214',
        'carb'   :'42.4',
        'prot'   :'6.7',
        'fat'    :'1',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ВареникиТворог : {
        'name'   :'Вареники с творогом',
        'gindex' :'60',
        'calo'   :'170',
        'carb'   :'36.4',
        'prot'   :'10.9',
        'fat'    :'1',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    Пельмени : {
        'name'   :'Пельмени',
        'gindex' :'60',
        'calo'   :'252',
        'carb'   :'37',
        'prot'   :'14',
        'fat'    :'6.3',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ПшенаяКашаВода : {
        'name'   :'Пшеная каша на воде',
        'gindex' :'70',
        'calo'   :'134',
        'carb'   :'26.1',
        'prot'   :'4.5',
        'fat'    :'1.3',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    РисоваяКашаВода : {
        'name'   :'Рисовая каша на воде',
        'gindex' :'80',
        'calo'   :'107',
        'carb'   :'63.5',
        'prot'   :'2.4',
        'fat'    :'0.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    БлиныВышСорт : {
        'name'   :'Блины из муки высшего сорта',
        'gindex' :'69',
        'calo'   :'185',
        'carb'   :'34.3',
        'prot'   :'5.2',
        'fat'    :'3',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ВареникиКартоф : {
        'name'   :'Вареники с картофелем',
        'gindex' :'66',
        'calo'   :'234',
        'carb'   :'42',
        'prot'   :'6',
        'fat'    :'3.6',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ПиццаСыр : {
        'name'   :'Пицца с сыром',
        'gindex' :'60',
        'calo'   :'236',
        'carb'   :'22.7',
        'prot'   :'6.6',
        'fat'    :'13.3',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ХлебВысшегоСорта : {
        'name'   :'Хлеб из муки высшего сорта',
        'gindex' :'80',
        'calo'   :'232',
        'carb'   :'48.6',
        'prot'   :'7.6',
        'fat'    :'0.8',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    МакароныВысшСорт : {
        'name'   :'Макароны высший сорт',
        'gindex' :'85',
        'calo'   :'344',
        'carb'   :'70',
        'prot'   :'12.8',
        'fat'    :'0.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    Мюсли : {
        'name'   :'Мюсли',
        'gindex' :'80',
        'calo'   :'352',
        'carb'   :'67.1',
        'prot'   :'11.3',
        'fat'    :'13.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    Сухарики : {
        'name'   :'Сухарики',
        'gindex' :'74',
        'calo'   :'360',
        'carb'   :'74',
        'prot'   :'11.5',
        'fat'    :'2',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ПеченьеКрекер : {
        'name'   :'Печенье крекер',
        'gindex' :'80',
        'calo'   :'352',
        'carb'   :'67.1',
        'prot'   :'11.3',
        'fat'    :'13.4',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    КукурузныеХлопья : {
        'name'   :'Перловая каша на воде',
        'gindex' :'85',
        'calo'   :'360',
        'carb'   :'80',
        'prot'   :'4',
        'fat'    :'0.5',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },


    ХлебБелыйБатон : {
        'name'   :'Хлеб белый, батон',
        'gindex' :'136',
        'calo'   :'369',
        'carb'   :'68.1',
        'prot'   :'7.4',
        'fat'    :'7.5',
        'vita'   :' ',
        'tags' : 'Зерновые продукты и изделия из муки'   
    },

  МолокоОбезжир : {
      'name'   :'Молоко обезжиренное',
      'gindex' :'27',
      'calo'   :'31',
      'carb'   :'4.7',
      'prot'   :'3',
      'fat'    :'0.2',
      'vita'   :' ',
      'tags' : 'Молочные продукты'   
    },


    ТворогОбезжир : {
        'name'   :'Творог нежирный',
        'gindex' :'30',
        'calo'   :'88',
        'carb'   :'1.2',
        'prot'   :'18',
        'fat'    :'1',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    МолокоСоевое : {
        'name'   :'Молоко соевое',
        'gindex' :'30',
        'calo'   :'40',
        'carb'   :'0.8',
        'prot'   :'3.8',
        'fat'    :'1.9',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },



    КефирНежир : {
        'name'   :'Кефир нежирный',
        'gindex' :'25',
        'calo'   :'30',
        'carb'   :'3.8',
        'prot'   :'3',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    Йогурт15Натуральный : {
        'name'   :'Йогурт 1.5% натуральный',
        'gindex' :'35',
        'calo'   :'47',
        'carb'   :'3.5',
        'prot'   :'5',
        'fat'    :'1.5',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    СырТофу : {
        'name'   :'Сыр тофу',
        'gindex' :'15',
        'calo'   :'73',
        'carb'   :'0.6',
        'prot'   :'8.3',
        'fat'    :'4.2',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    МолокоНатуральное : {
        'name'   :'Молоко натуральное',
        'gindex' :'32',
        'calo'   :'60',
        'carb'   :'4.8',
        'prot'   :'3.1',
        'fat'    :'4.2',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    Творог9 : {
        'name'   :'Творог 9% жирности',
        'gindex' :'30',
        'calo'   :'185',
        'carb'   :'2',
        'prot'   :'14',
        'fat'    :'9',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    МолокоСоевое : {
        'name'   :'Молоко соевое',
        'gindex' :'30',
        'calo'   :'40',
        'carb'   :'0.8',
        'prot'   :'3.8',
        'fat'    :'1.9',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    ЙогуртФруктовый : {
        'name'   :'Йогурт фруктовый',
        'gindex' :'52',
        'calo'   :'105',
        'carb'   :'15.7',
        'prot'   :'5.1',
        'fat'    :'2.8',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    Брынза : {
        'name'   :'Брынза',
        'gindex' :'0',
        'calo'   :'260',
        'carb'   :'0',
        'prot'   :'17.9',
        'fat'    :'20.1',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    СырФета : {
        'name'   :'Сыр фета',
        'gindex' :'56',
        'calo'   :'243',
        'carb'   :'2.5',
        'prot'   :'11',
        'fat'    :'21',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    ТворожнаяМасса : {
        'name'   :'Творожная масса',
        'gindex' :'45',
        'calo'   :'340',
        'carb'   :'10',
        'prot'   :'7',
        'fat'    :'23',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    СырникиИзТворога : {
        'name'   :'Сырники из творога',
        'gindex' :'70',
        'calo'   :'220',
        'carb'   :'10.6',
        'prot'   :'17.4',
        'fat'    :'12',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    СырСулугуни : {
        'name'   :'Сыр сулугуни',
        'gindex' :'0',
        'calo'   :'285',
        'carb'   :'0',
        'prot'   :'19.5',
        'fat'    :'22',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    СырПлавленный : {
        'name'   :'Сыр плавленный',
        'gindex' :'57',
        'calo'   :'323',
        'carb'   :'3.8',
        'prot'   :'20',
        'fat'    :'27',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    СырТвердый : {
        'name'   :'Сыры твердые',
        'gindex' :'0',
        'calo'   :'260',
        'carb'   :'0',
        'prot'   :'23',
        'fat'    :'30',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    Сливки10 : {
        'name'   :'Сливки 10% жирности',
        'gindex' :'30',
        'calo'   :'118',
        'carb'   :'3.7',
        'prot'   :'2.8',
        'fat'    :'10',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    Сметана20 : {
        'name'   :'Сметана 20% жирности',
        'gindex' :'58',
        'calo'   :'204',
        'carb'   :'3.2',
        'prot'   :'2.8',
        'fat'    :'20',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    МолокоСоевое : {
        'name'   :'Молоко соевое',
        'gindex' :'30',
        'calo'   :'40',
        'carb'   :'0.8',
        'prot'   :'3.8',
        'fat'    :'1.9',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    Мороженое : {
        'name'   :'Мороженое',
        'gindex' :'70',
        'calo'   :'218',
        'carb'   :'23.7',
        'prot'   :'4.2',
        'fat'    :'11.8',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },


    МолокоСгущеное : {
        'name'   :'Молоко сгущеное с сахаром',
        'gindex' :'80',
        'calo'   :'329',
        'carb'   :'56',
        'prot'   :'7.2',
        'fat'    :'8.5',
        'vita'   :' ',
        'tags' : 'Молочные продукты'   
    },

    ТрескаОтвар : {
        'name'   :'Треска отварная',
        'gindex' :'0',
        'calo'   :'76',
        'carb'   :'0',
        'prot'   :'17',
        'fat'    :'0.7',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ЩукаОтвар : {
        'name'   :'Щука отварная',
        'gindex' :'0',
        'calo'   :'78',
        'carb'   :'0',
        'prot'   :'18',
        'fat'    :'0.5',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    КрабыОтвар : {
        'name'   :'Крабы отварные',
        'gindex' :'0',
        'calo'   :'85',
        'carb'   :'0',
        'prot'   :'18.7',
        'fat'    :'1.1',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    МорскаяКапуста : {
        'name'   :'Морская капуста',
        'gindex' :'22',
        'calo'   :'5',
        'carb'   :'0.3',
        'prot'   :'0.9',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ХекОтвар : {
        'name'   :'Хек отварной',
        'gindex' :'0',
        'calo'   :'86',
        'carb'   :'0',
        'prot'   :'16.6',
        'fat'    :'2.2',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ФорельОтвар : {
        'name'   :'Форель отварная',
        'gindex' :'0',
        'calo'   :'89',
        'carb'   :'0',
        'prot'   :'15.5',
        'fat'    :'3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    Креветки : {
        'name'   :'Креветки',
        'gindex' :'0',
        'calo'   :'95',
        'carb'   :'0',
        'prot'   :'20',
        'fat'    :'1.8',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    УстрицыОтвар : {
        'name'   :'Устрицы отварные',
        'gindex' :'0',
        'calo'   :'95',
        'carb'   :'0',
        'prot'   :'14',
        'fat'    :'3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ТунецВСоку : {
        'name'   :'Тунец в собственном соку',
        'gindex' :'0',
        'calo'   :'96',
        'carb'   :'0',
        'prot'   :'21',
        'fat'    :'1',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    Судак : {
        'name'   :'Судак',
        'gindex' :'0',
        'calo'   :'97',
        'carb'   :'0',
        'prot'   :'21.3',
        'fat'    :'1.3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    Камбала : {
        'name'   :'Камбала',
        'gindex' :'0',
        'calo'   :'105',
        'carb'   :'0',
        'prot'   :'18.2',
        'fat'    :'2.3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    РакиОтвар : {
        'name'   :'Раки отварные',
        'gindex' :'5',
        'calo'   :'97',
        'carb'   :'1',
        'prot'   :'20.3',
        'fat'    :'1.3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    КальмарОтвар : {
        'name'   :'Кальмары отварные',
        'gindex' :'0',
        'calo'   :'140',
        'carb'   :'0',
        'prot'   :'30.4',
        'fat'    :'2.2',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    КефальОтвар : {
        'name'   :'Кефаль отварная',
        'gindex' :'0',
        'calo'   :'115',
        'carb'   :'0',
        'prot'   :'19',
        'fat'    :'4.3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ИкраМинтай : {
        'name'   :'Икра минтая',
        'gindex' :'0',
        'calo'   :'131',
        'carb'   :'0',
        'prot'   :'28.4',
        'fat'    :'1.9',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    Белуга : {
        'name'   :'Белуга',
        'gindex' :'0',
        'calo'   :'131',
        'carb'   :'0',
        'prot'   :'23.8',
        'fat'    :'4',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    Сельдь : {
        'name'   :'Сельдь',
        'gindex' :'0',
        'calo'   :'140',
        'carb'   :'0',
        'prot'   :'15.5',
        'fat'    :'8.7',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ТрескаКопч : {
        'name'   :'Треска копченая',
        'gindex' :'0',
        'calo'   :'111',
        'carb'   :'0',
        'prot'   :'23.3',
        'fat'    :'0.9',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ГорбушаКопч : {
        'name'   :'Горбуша копченая',
        'gindex' :'0',
        'calo'   :'161',
        'carb'   :'0',
        'prot'   :'23.2',
        'fat'    :'7.6',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ОкуньЖар : {
        'name'   :'Окунь жареный',
        'gindex' :'0',
        'calo'   :'158',
        'carb'   :'0',
        'prot'   :'19',
        'fat'    :'8.9',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    КарпЖар : {
        'name'   :'Карп жареный',
        'gindex' :'0',
        'calo'   :'196',
        'carb'   :'0',
        'prot'   :'18.3',
        'fat'    :'11.6',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    СардинаОтвар : {
        'name'   :'Сардина отварная',
        'gindex' :'0',
        'calo'   :'178',
        'carb'   :'0',
        'prot'   :'20',
        'fat'    :'10.8',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    СемгаОтвар  : {
        'name'   :'Семга отварная',
        'gindex' :'0',
        'calo'   :'210',
        'carb'   :'0',
        'prot'   :'16.3',
        'fat'    :'15',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ИкраКрасная : {
        'name'   :'Икра красная',
        'gindex' :'0',
        'calo'   :'261',
        'carb'   :'0',
        'prot'   :'31.6',
        'fat'    :'13.8',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    КотлетыРыбные : {
        'name'   :'Котлеты рыбные',
        'gindex' :'20',
        'calo'   :'168',
        'carb'   :'16.1',
        'prot'   :'12.5',
        'fat'    :'6',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    УгорьКопч : {
        'name'   :'Угорь копченый',
        'gindex' :'0',
        'calo'   :'363',
        'carb'   :'0',
        'prot'   :'17.7',
        'fat'    :'32.4',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    КрабовыеПалочки : {
        'name'   :'Крабовые палочки',
        'gindex' :'40',
        'calo'   :'94',
        'carb'   :'9.5',
        'prot'   :'5',
        'fat'    :'4.3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ТрескаПечень : {
        'name'   :'Печень трески',
        'gindex' :'0',
        'calo'   :'613',
        'carb'   :'0',
        'prot'   :'4.2',
        'fat'    :'65.7',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    СардинаМасл : {
        'name'   :'Сардина в масле',
        'gindex' :'0',
        'calo'   :'249',
        'carb'   :'0',
        'prot'   :'17.9',
        'fat'    :'19.7',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    СкумбрияМасл : {
        'name'   :'Скумбрия в масле',
        'gindex' :'0',
        'calo'   :'278',
        'carb'   :'0',
        'prot'   :'13.1',
        'fat'    :'25.1',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    СайраМасл : {
        'name'   :'Сайра в масле',
        'gindex' :'0',
        'calo'   :'283',
        'carb'   :'0',
        'prot'   :'18.3',
        'fat'    :'23.3',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    ШпротыМасл : {
        'name'   :'Шпроты в масле',
        'gindex' :'0',
        'calo'   :'363',
        'carb'   :'0',
        'prot'   :'17.4',
        'fat'    :'32.4',
        'vita'   :' ',
        'tags' : 'Рыба и морепродукты'   
    },

    // фрукты и ягоды

    Лимон : {
        'name'   :'Лимон',
        'gindex' :'20',
        'calo'   :'33',
        'carb'   :'3',
        'prot'   :'0.9',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Грейпфрут : {
        'name'   :'Грейпфрут',
        'gindex' :'22',
        'calo'   :'35',
        'carb'   :'6.5',
        'prot'   :'0.7',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Малина : {
        'name'   :'Малина',
        'gindex' :'30',
        'calo'   :'39',
        'carb'   :'8.3',
        'prot'   :'0.8',
        'fat'    :'0.3',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Яблоки : {
        'name'   :'Яблоки',
        'gindex' :'30',
        'calo'   :'44',
        'carb'   :'9.8',
        'prot'   :'0.4',
        'fat'    :'0.4',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Ежевика : {
        'name'   :'ПродуктНейм',
        'gindex' :'25',
        'calo'   :'31',
        'carb'   :'4.4',
        'prot'   :'2',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Земляника : {
        'name'   :'Земляника',
        'gindex' :'25',
        'calo'   :'34',
        'carb'   :'6.3',
        'prot'   :'0.8',
        'fat'    :'0.4',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Черника : {
        'name'   :'Черника',
        'gindex' :'43',
        'calo'   :'41',
        'carb'   :'8.4',
        'prot'   :'1.1',
        'fat'    :'0.6',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Голубика : {
        'name'   :'Голубика',
        'gindex' :'42',
        'calo'   :'34',
        'carb'   :'7.7',
        'prot'   :'1',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    СмородинаКрасная : {
        'name'   :'Смородина красная',
        'gindex' :'30',
        'calo'   :'35',
        'carb'   :'7.3',
        'prot'   :'1',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    СмородинаЧерная : {
        'name'   :'Смородина черная',
        'gindex' :'15',
        'calo'   :'38',
        'carb'   :'7.3',
        'prot'   :'1',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Алыча : {
        'name'   :'Алыча',
        'gindex' :'25',
        'calo'   :'27',
        'carb'   :'6.4',
        'prot'   :'0.2',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Брусника : {
        'name'   :'Брусника',
        'gindex' :'25',
        'calo'   :'43',
        'carb'   :'8',
        'prot'   :'0.7',
        'fat'    :'0.5',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Абрикос : {
        'name'   :'Абрикос',
        'gindex' :'20',
        'calo'   :'40',
        'carb'   :'9',
        'prot'   :'0.9',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Персик : {
        'name'   :'Персик',
        'gindex' :'30',
        'calo'   :'42',
        'carb'   :'9.5',
        'prot'   :'0.9',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Груша : {
        'name'   :'Груша',
        'gindex' :'34',
        'calo'   :'42',
        'carb'   :'9.5',
        'prot'   :'0.8',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Слива : {
        'name'   :'Слива',
        'gindex' :'22',
        'calo'   :'43',
        'carb'   :'9.6',
        'prot'   :'0.8',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Клубника : {
        'name'   :'Клубника',
        'gindex' :'32',
        'calo'   :'32',
        'carb'   :'6.3',
        'prot'   :'0.8',
        'fat'    :'0.4',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Апельсин : {
        'name'   :'Апельсин',
        'gindex' :'35',
        'calo'   :'38',
        'carb'   :'8.3',
        'prot'   :'0.9',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Вишня : {
        'name'   :'Вишня',
        'gindex' :'22',
        'calo'   :'49',
        'carb'   :'10.3',
        'prot'   :'0.8',
        'fat'    :'0.5',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Гранат : {
        'name'   :'Гранат',
        'gindex' :'35',
        'calo'   :'52',
        'carb'   :'11.2',
        'prot'   :'0.9',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Нектарин : {
        'name'   :'Нектарин',
        'gindex' :'35',
        'calo'   :'48',
        'carb'   :'11.8',
        'prot'   :'0.9',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Клюква : {
        'name'   :'Клюква',
        'gindex' :'45',
        'calo'   :'26',
        'carb'   :'3.8',
        'prot'   :'0.5',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Киви : {
        'name'   :'Киви',
        'gindex' :'50',
        'calo'   :'49',
        'carb'   :'11.5',
        'prot'   :'0.4',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Облепиха : {
        'name'   :'Облепиха',
        'gindex' :'30',
        'calo'   :'52',
        'carb'   :'5',
        'prot'   :'0.9',
        'fat'    :'2.5',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Черешня : {
        'name'   :'Черешня',
        'gindex' :'25',
        'calo'   :'50',
        'carb'   :'10.6',
        'prot'   :'1.2',
        'fat'    :'0.4',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Мандарин : {
        'name'   :'Мандарин',
        'gindex' :'40',
        'calo'   :'38',
        'carb'   :'8.1',
        'prot'   :'0.8',
        'fat'    :'0.3',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Крыжовник : {
        'name'   :'Крыжовник',
        'gindex' :'40',
        'calo'   :'41',
        'carb'   :'9.1',
        'prot'   :'0.7',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Хурма : {
        'name'   :'Хурма',
        'gindex' :'55',
        'calo'   :'55',
        'carb'   :'13.2',
        'prot'   :'0.5',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Манго : {
        'name'   :'Манго',
        'gindex' :'55',
        'calo'   :'67',
        'carb'   :'13.5',
        'prot'   :'0.5',
        'fat'    :'0.3',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Дыня : {
        'name'   :'Дыня',
        'gindex' :'60',
        'calo'   :'39',
        'carb'   :'9.1',
        'prot'   :'0.6',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Банан : {
        'name'   :'Банан',
        'gindex' :'60',
        'calo'   :'91',
        'carb'   :'21',
        'prot'   :'1.5',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Виноград : {
        'name'   :'Виноград',
        'gindex' :'40',
        'calo'   :'64',
        'carb'   :'16',
        'prot'   :'0.6',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Ананас : {
        'name'   :'Ананас',
        'gindex' :'66',
        'calo'   :'49',
        'carb'   :'11.6',
        'prot'   :'0.5',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Арбуз : {
        'name'   :'Арбуз',
        'gindex' :'72',
        'calo'   :'40',
        'carb'   :'8.8',
        'prot'   :'0.7',
        'fat'    :'0.2',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Изюм : {
        'name'   :'Изюм',
        'gindex' :'65',
        'calo'   :'271',
        'carb'   :'66',
        'prot'   :'1.8',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Чернослив : {
        'name'   :'Чернослив',
        'gindex' :'25',
        'calo'   :'242',
        'carb'   :'58.4',
        'prot'   :'2.3',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Инжир : {
        'name'   :'Инжир',
        'gindex' :'35',
        'calo'   :'257',
        'carb'   :'57.9',
        'prot'   :'3.1',
        'fat'    :'0.8',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Курага : {
        'name'   :'Курага',
        'gindex' :'30',
        'calo'   :'240',
        'carb'   :'55',
        'prot'   :'5.2',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    Финик : {
        'name'   :'Финик',
        'gindex' :'146',
        'calo'   :'306',
        'carb'   :'72.3',
        'prot'   :'2',
        'fat'    :'0.5',
        'vita'   :' ',
        'tags' : 'Фрукты и ягоды'   
    },

    // Прочее

    Яйцо : {
        'name'   :'Яйцо (1шт)',
        'gindex' :'48',
        'calo'   :'76',
        'carb'   :'0.7',
        'prot'   :'6.3',
        'fat'    :'5.2',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    ЯйцоБелок : {
        'name'   :'Яйцо (1шт), белок',
        'gindex' :'48',
        'calo'   :'17',
        'carb'   :'0.4',
        'prot'   :'3.6',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    ЯйцоЖелток : {
        'name'   :'Яйцо (1шт), желток',
        'gindex' :'50',
        'calo'   :'59',
        'carb'   :'0.3',
        'prot'   :'2.7',
        'fat'    :'5.2',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    ГрецкийОрех : {
        'name'   :'Грецкий орех',
        'gindex' :'15',
        'calo'   :'710',
        'carb'   :'15.2',
        'prot'   :'15.6',
        'fat'    :'65.2',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Фундук : {
        'name'   :'Фундук',
        'gindex' :'15',
        'calo'   :'706',
        'carb'   :'9.9',
        'prot'   :'16.1',
        'fat'    :'66.9',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Миндаль : {
        'name'   :'Миндаль',
        'gindex' :'25',
        'calo'   :'648',
        'carb'   :'13.6',
        'prot'   :'18.6',
        'fat'    :'57.7',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Фисташки : {
        'name'   :'Фисташки',
        'gindex' :'15',
        'calo'   :'577',
        'carb'   :'10.8',
        'prot'   :'21.8',
        'fat'    :'50',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Арахис : {
        'name'   :'Арахис',
        'gindex' :'20',
        'calo'   :'8',
        'carb'   :'10.8',
        'prot'   :'20.9',
        'fat'    :'45.2',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    СемечкиПодсолнуха : {
        'name'   :'Семечки подсолнуха',
        'gindex' :'8',
        'calo'   :'572',
        'carb'   :'4',
        'prot'   :'21',
        'fat'    :'53',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    СемечкиТыквенные : {
        'name'   :'Семечки тыквенные',
        'gindex' :'25',
        'calo'   :'600',
        'carb'   :'15.7',
        'prot'   :'28',
        'fat'    :'46.7',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    КокосОрех : {
        'name'   :'Кокосовый орех',
        'gindex' :'45',
        'calo'   :'380',
        'carb'   :'29.5',
        'prot'   :'3.4',
        'fat'    :'33.5',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    ШоколадТемн : {
        'name'   :'Шоколад темный',
        'gindex' :'22',
        'calo'   :'539',
        'carb'   :'48.2',
        'prot'   :'6.2',
        'fat'    :'35.4',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Мед : {
        'name'   :'Мед',
        'gindex' :'90',
        'calo'   :'314',
        'carb'   :'80.3',
        'prot'   :'0.8',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Варенье : {
        'name'   :'Варенье',
        'gindex' :'70',
        'calo'   :'271',
        'carb'   :'70.9',
        'prot'   :'0.3',
        'fat'    :'0.3',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    ШоколадМолоч : {
        'name'   :'Шоколад молочный',
        'gindex' :'70',
        'calo'   :'550',
        'carb'   :'52.4',
        'prot'   :'5',
        'fat'    :'34.7',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    ШоколадБатон : {
        'name'   :'Шоколадный батончик',
        'gindex' :'70',
        'calo'   :'550',
        'carb'   :'69',
        'prot'   :'4',
        'fat'    :'25',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Халва : {
        'name'   :'Халва',
        'gindex' :'70',
        'calo'   :'522',
        'carb'   :'50.6',
        'prot'   :'12.7',
        'fat'    :'29.9',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Карамель : {
        'name'   :'Карамель',
        'gindex' :'80',
        'calo'   :'375',
        'carb'   :'97',
        'prot'   :'0',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Мармелад : {
        'name'   :'Мармелад',
        'gindex' :'30',
        'calo'   :'306',
        'carb'   :'76',
        'prot'   :'0.4',
        'fat'    :'0.1',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Сахар : {
        'name'   :'Сахар',
        'gindex' :'70',
        'calo'   :'374',
        'carb'   :'99.8',
        'prot'   :'0',
        'fat'    :'0',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    Попкорн : {
        'name'   :'Попкорн',
        'gindex' :'85',
        'calo'   :'480',
        'carb'   :'77.6',
        'prot'   :'2.1',
        'fat'    :'20',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    КуринаяГрудкаОтвар : {
        'name'   :'Куриная грудка отварная',
        'gindex' :'0',
        'calo'   :'137',
        'carb'   :'0',
        'prot'   :'29.8',
        'fat'    :'1.8',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ТелятинаОтвар : {
        'name'   :'Телятина отварная',
        'gindex' :'0',
        'calo'   :'134',
        'carb'   :'0',
        'prot'   :'27.8',
        'fat'    :'3.1',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ИндейкаОтвар : {
        'name'   :'Индейка отварная',
        'gindex' :'0',
        'calo'   :'195',
        'carb'   :'0',
        'prot'   :'25.7',
        'fat'    :'10.4',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ГовядинаНежирОтвар : {
        'name'   :'Говядина постная отварная',
        'gindex' :'0',
        'calo'   :'175',
        'carb'   :'0',
        'prot'   :'25.7',
        'fat'    :'8.1',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    КроликЖар : {
        'name'   :'Кролик жареный',
        'gindex' :'0',
        'calo'   :'212',
        'carb'   :'0',
        'prot'   :'28.7',
        'fat'    :'10.8',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ПочкиТуш : {
        'name'   :'Почки тушеные',
        'gindex' :'0',
        'calo'   :'156',
        'carb'   :'0',
        'prot'   :'26.1',
        'fat'    :'5.8',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ГовяжПеченьЖар : {
        'name'   :'Говяжья печень жареная',
        'gindex' :'50',
        'calo'   :'199',
        'carb'   :'3.9',
        'prot'   :'22.9',
        'fat'    :'10.2',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ГовяжЯзыкОтвар : {
        'name'   :'Говяжий язык отварной',
        'gindex' :'0',
        'calo'   :'231',
        'carb'   :'0',
        'prot'   :'23.9',
        'fat'    :'15',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    ГовяжМозги : {
        'name'   :'Говяжьи мозги',
        'gindex' :'0',
        'calo'   :'124',
        'carb'   :'0',
        'prot'   :'11.7',
        'fat'    :'8.6',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    Омлет : {
        'name'   :'Омлет',
        'gindex' :'49',
        'calo'   :'210',
        'carb'   :'2.1',
        'prot'   :'14',
        'fat'    :'15',
        'vita'   :' ',
        'tags' : 'Прочее'  
    },

    КурицаЖар : {
        'name'   :'Курица жареная',
        'gindex' :'0',
        'calo'   :'262',
        'carb'   :'0',
        'prot'   :'31.2',
        'fat'    :'15.3',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    СвининаГриль : {
        'name'   :'Свинина на гриле',
        'gindex' :'0',
        'calo'   :'280',
        'carb'   :'0',
        'prot'   :'19.9',
        'fat'    :'22',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    БаранинаОтвар : {
        'name'   :'Баранина отварная',
        'gindex' :'0',
        'calo'   :'293',
        'carb'   :'0',
        'prot'   :'21.9',
        'fat'    :'22.6',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    Бефстроганов : {
        'name'   :'Бефстроганов',
        'gindex' :'56',
        'calo'   :'207',
        'carb'   :'5.7',
        'prot'   :'16.6',
        'fat'    :'13.1',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    СвининаКотл : {
        'name'   :'Котлета из свинины',
        'gindex' :'50',
        'calo'   :'262',
        'carb'   :'9.6',
        'prot'   :'11.7',
        'fat'    :'19.6',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    Сосиски : {
        'name'   :'Сосиски',
        'gindex' :'28',
        'calo'   :'266',
        'carb'   :'1.6',
        'prot'   :'10.4',
        'fat'    :'24',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    КолбасаВар : {
        'name'   :'Колбаса вареная',
        'gindex' :'34',
        'calo'   :'300',
        'carb'   :'3',
        'prot'   :'12',
        'fat'    :'28',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    Гусь : {
        'name'   :'Гусь',
        'gindex' :'0',
        'calo'   :'319',
        'carb'   :'0',
        'prot'   :'29.3',
        'fat'    :'22.4',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    Баранина : {
        'name'   :'Баранина',
        'gindex' :'0',
        'calo'   :'319',
        'carb'   :'0',
        'prot'   :'24',
        'fat'    :'25',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    УткаЖар : {
        'name'   :'Утка жареная',
        'gindex' :'0',
        'calo'   :'407',
        'carb'   :'0',
        'prot'   :'23.2',
        'fat'    :'34.8',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    },

    СвининаЖар : {
        'name'   :'Свинина жареная',
        'gindex' :'0',
        'calo'   :'407',
        'carb'   :'0',
        'prot'   :'17.7',
        'fat'    :'37.4',
        'vita'   :' ',
        'tags' : 'Мясо и птица'  
    }

}
